console.log('1. Вёрстка валидная +10 \n 2. Вёрстка семантическая +20 \n 3. В коде странице присутствуют <header>, <main>, <footer> +3 \n 4. </footer>пять элементов <section> (по количеству секций) +3 \n 5. только один заголовок <h1> +3 \n 6. четыре заголовка <h2> +3 \n 7. один элемент <nav> +3 \n 8. два списка ul > li > a  +3 \n 9. пять кнопок <button> +2    Yes 5 buttons + slider \n 10. Вёрстка соответствует макету +48 \n 11. блок <header> +6 \n 12. секция welcome +7 \n 13. секция about +7 \n 14. секция service +7 \n 15. секция prices +7 \n 16. секция contacts +7 \n 17. блок <footer> +7 \n 18. Требования к css + 12 \n 19. для построения сетки используются флексы или гриды +2 \n 20. при уменьшении масштаба страницы браузера вёрстка размещается по центру, а не сдвигается в сторону +2 \n 21. фоновый цвет тянется на всю ширину страницы +2 \n 22. иконки добавлены в формате .svg. SVG может быть добавлен любым способом. Обращаем внимание на формат, а не на способ добавления +2 \n 23. изображения добавлены в формате .jpg или .png +2 (webp) \n 24. есть favicon +2 \n 25. Интерактивность, реализуемая через css +20 \n 26. плавная прокрутка по якорям +5 \n 27. иконки соцсетей в футере при нажатии на них ведут на гитхаб автора проекта и на страницу курса (допускается добавление своих вариантов иконок github или RSSchool) https://rs.school/js-stage0/ +5 \n 28. интерактивность включает в себя не только изменение внешнего вида курсора, например, при помощи свойства cursor: pointer, но и другие визуальные эффекты, например, изменение цвета фона или цвета шрифта. Если в макете указаны стили при наведении и клике, для элемента указываем эти стили. Если в макете стили не указаны, реализуете их по своему усмотрению, руководствуясь общим стилем макета +5 \n 29. обязательное требование к интерактивности: плавное изменение внешнего вида элемента при наведении и клике не влияющее на соседние элементы +5 \n ');



/* 

1. Вёрстка валидная +10 \n
2. Вёрстка семантическая +20 \n
3. В коде странице присутствуют <header>, <main>, <footer> +3 \n
4. </footer>пять элементов <section> (по количеству секций) +3 \n
5. только один заголовок <h1> +3 \n
6. четыре заголовка <h2> +3 \n
7. один элемент <nav> +3 \n
8. два списка ul > li > a  +3 \n
9. пять кнопок <button> +2    Yes 5 buttons + slider
10. Вёрстка соответствует макету +48 \n
11. блок <header> +6 \n
12. секция welcome +7 \n
13. секция about +7 \n
14. секция service +7 \n
15. секция prices +7 \n
16. секция contacts +7 \n
17. блок <footer> +7 \n
18. Требования к css + 12 \n
19. для построения сетки используются флексы или гриды +2 \n
20. при уменьшении масштаба страницы браузера вёрстка размещается по центру, а не сдвигается в сторону +2 \n
21. фоновый цвет тянется на всю ширину страницы +2 \n
22. иконки добавлены в формате .svg. SVG может быть добавлен любым способом. Обращаем внимание на формат, а не на способ добавления +2 \n
23. изображения добавлены в формате .jpg или .png +2 (webp) \n
24. есть favicon +2 \n
25. Интерактивность, реализуемая через css +20 \n
26. плавная прокрутка по якорям +5 \n
27. иконки соцсетей в футере при нажатии на них ведут на гитхаб автора проекта и на страницу курса (допускается добавление своих вариантов иконок github или RSSchool) https://rs.school/js-stage0/ +5 \n
28. интерактивность включает в себя не только изменение внешнего вида курсора, например, при помощи свойства cursor: pointer, но и другие визуальные эффекты, например, изменение цвета фона или цвета шрифта. Если в макете указаны стили при наведении и клике, для элемента указываем эти стили. Если в макете стили не указаны, реализуете их по своему усмотрению, руководствуясь общим стилем макета +5 \n
29. обязательное требование к интерактивности: плавное изменение внешнего вида элемента при наведении и клике не влияющее на соседние элементы +5 \n

*/